coanda/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            patch;
        nFaces          400;
        startFace       210510;
    }
    right
    {
        type            patch;
        nFaces          530;
        startFace       210910;
    }
    up
    {
        type            patch;
        nFaces          240;
        startFace       211440;
    }
    meanFlow
    {
        type            patch;
        nFaces          220;
        startFace       211680;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1510;
        startFace       211900;
    }
    coandaInlet
    {
        type            patch;
        nFaces          80;
        startFace       213410;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          212000;
        startFace       213490;
    }
)

// ************************************************************************* //
