coanda/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

def_pl          uniform 1.4e-2;
def_fs          uniform 1.2e-5;

internalField   $def_pl;

boundaryField
{
    meanFlow
    {
        type            freestream;
        freestreamValue $def_pl;
    }

    right
    {
        type            freestream;
        freestreamValue $def_pl;
    }

    down
    {
        type            slip;
    }

    up
    {
        type            slip;
    }

    surface
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    coandaInlet
    {
        type            freestream;
        freestreamValue $def_pl;
    }
}

// ************************************************************************* //
